micropython/micropython/ports/cc3200/hal/inc/hw_mcasp.h
//*****************************************************************************
//
//  Copyright (C) 2014 Texas Instruments Incorporated - http://www.ti.com/
//
//
//  Redistribution and use in source and binary forms, with or without
//  modification, are permitted provided that the following conditions
//  are met:
//
//    Redistributions of source code must retain the above copyright
//    notice, this list of conditions and the following disclaimer.
//
//    Redistributions in binary form must reproduce the above copyright
//    notice, this list of conditions and the following disclaimer in the
//    documentation and/or other materials provided with the
//    distribution.
//
//    Neither the name of Texas Instruments Incorporated nor the names of
//    its contributors may be used to endorse or promote products derived
//    from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
//*****************************************************************************

#ifndef __HW_MCASP_H__
#define __HW_MCASP_H__

//*****************************************************************************
//
// The following are defines for the MCASP register offsets.
//
//*****************************************************************************
#define MCASP_O_PID             0x00000000
#define MCASP_O_ESYSCONFIG      0x00000004  // Power Idle SYSCONFIG register.
#define MCASP_O_PFUNC           0x00000010
#define MCASP_O_PDIR            0x00000014
#define MCASP_O_PDOUT           0x00000018
#define MCASP_O_PDSET           0x0000001C  // The pin data set register
                                            // (PDSET) is an alias of the pin
                                            // data output register (PDOUT) for
                                            // writes only. Writing a 1 to the
                                            // PDSET bit sets the corresponding
                                            // bit in PDOUT and if PFUNC = 1
                                            // (GPIO function) and PDIR = 1
                                            // (output) drives a logic high on
                                            // the pin.
#define MCASP_O_PDIN            0x0000001C  // The pin data input register
                                            // (PDIN) holds the I/O pin state of
                                            // each of the McASP pins. PDIN
                                            // allows the actual value of the
                                            // pin to be read regardless of the
                                            // state of PFUNC and PDIR.
#define MCASP_O_PDCLR           0x00000020  // The pin data clear register
                                            // (PDCLR) is an alias of the pin
                                            // data output register (PDOUT) for
                                            // writes only. Writing a 1 to the
                                            // PDCLR bit clears the
                                            // corresponding bit in PDOUT and if
                                            // PFUNC = 1 (GPIO function) and
                                            // PDIR = 1 (output) drives a logic
                                            // low on the pin.
#define MCASP_O_TLGC            0x00000030  // for IODFT
#define MCASP_O_TLMR            0x00000034  // for IODFT
#define MCASP_O_TLEC            0x00000038  // for IODFT
#define MCASP_O_GBLCTL          0x00000044
#define MCASP_O_AMUTE           0x00000048
#define MCASP_O_LBCTL           0x0000004C
#define MCASP_O_TXDITCTL        0x00000050
#define MCASP_O_GBLCTLR         0x00000060
#define MCASP_O_RXMASK          0x00000064
#define MCASP_O_RXFMT           0x00000068
#define MCASP_O_RXFMCTL         0x0000006C
#define MCASP_O_ACLKRCTL        0x00000070
#define MCASP_O_AHCLKRCTL       0x00000074
#define MCASP_O_RXTDM           0x00000078
#define MCASP_O_EVTCTLR         0x0000007C
#define MCASP_O_RXSTAT          0x00000080
#define MCASP_O_RXTDMSLOT       0x00000084
#define MCASP_O_RXCLKCHK        0x00000088
#define MCASP_O_REVTCTL         0x0000008C
#define MCASP_O_GBLCTLX         0x000000A0
#define MCASP_O_TXMASK          0x000000A4
#define MCASP_O_TXFMT           0x000000A8
#define MCASP_O_TXFMCTL         0x000000AC
#define MCASP_O_ACLKXCTL        0x000000B0
#define MCASP_O_AHCLKXCTL       0x000000B4
#define MCASP_O_TXTDM           0x000000B8
#define MCASP_O_EVTCTLX         0x000000BC
#define MCASP_O_TXSTAT          0x000000C0
#define MCASP_O_TXTDMSLOT       0x000000C4
#define MCASP_O_TXCLKCHK        0x000000C8
#define MCASP_O_XEVTCTL         0x000000CC
#define MCASP_O_CLKADJEN        0x000000D0
#define MCASP_O_DITCSRA0        0x00000100
#define MCASP_O_DITCSRA1        0x00000104
#define MCASP_O_DITCSRA2        0x00000108
#define MCASP_O_DITCSRA3        0x0000010C
#define MCASP_O_DITCSRA4        0x00000110
#define MCASP_O_DITCSRA5        0x00000114
#define MCASP_O_DITCSRB0        0x00000118
#define MCASP_O_DITCSRB1        0x0000011C
#define MCASP_O_DITCSRB2        0x00000120
#define MCASP_O_DITCSRB3        0x00000124
#define MCASP_O_DITCSRB4        0x00000128
#define MCASP_O_DITCSRB5        0x0000012C
#define MCASP_O_DITUDRA0        0x00000130
#define MCASP_O_DITUDRA1        0x00000134
#define MCASP_O_DITUDRA2        0x00000138
#define MCASP_O_DITUDRA3        0x0000013C
#define MCASP_O_DITUDRA4        0x00000140
#define MCASP_O_DITUDRA5        0x00000144
#define MCASP_O_DITUDRB0        0x00000148
#define MCASP_O_DITUDRB1        0x0000014C
#define MCASP_O_DITUDRB2        0x00000150
#define MCASP_O_DITUDRB3        0x00000154
#define MCASP_O_DITUDRB4        0x00000158
#define MCASP_O_DITUDRB5        0x0000015C
#define MCASP_O_XRSRCTL0        0x00000180
#define MCASP_O_XRSRCTL1        0x00000184
#define MCASP_O_XRSRCTL2        0x00000188
#define MCASP_O_XRSRCTL3        0x0000018C
#define MCASP_O_XRSRCTL4        0x00000190
#define MCASP_O_XRSRCTL5        0x00000194
#define MCASP_O_XRSRCTL6        0x00000198
#define MCASP_O_XRSRCTL7        0x0000019C
#define MCASP_O_XRSRCTL8        0x000001A0
#define MCASP_O_XRSRCTL9        0x000001A4
#define MCASP_O_XRSRCTL10       0x000001A8
#define MCASP_O_XRSRCTL11       0x000001AC
#define MCASP_O_XRSRCTL12       0x000001B0
#define MCASP_O_XRSRCTL13       0x000001B4
#define MCASP_O_XRSRCTL14       0x000001B8
#define MCASP_O_XRSRCTL15       0x000001BC
#define MCASP_O_TXBUF0          0x00000200
#define MCASP_O_TXBUF1          0x00000204
#define MCASP_O_TXBUF2          0x00000208
#define MCASP_O_TXBUF3          0x0000020C
#define MCASP_O_TXBUF4          0x00000210
#define MCASP_O_TXBUF5          0x00000214
#define MCASP_O_TXBUF6          0x00000218
#define MCASP_O_TXBUF7          0x0000021C
#define MCASP_O_TXBUF8          0x00000220
#define MCASP_O_TXBUF9          0x00000224
#define MCASP_O_TXBUF10         0x00000228
#define MCASP_O_TXBUF11         0x0000022C
#define MCASP_O_TXBUF12         0x00000230
#define MCASP_O_TXBUF13         0x00000234
#define MCASP_O_TXBUF14         0x00000238
#define MCASP_O_TXBUF15         0x0000023C
#define MCASP_O_RXBUF0          0x00000280
#define MCASP_O_RXBUF1          0x00000284
#define MCASP_O_RXBUF2          0x00000288
#define MCASP_O_RXBUF3          0x0000028C
#define MCASP_O_RXBUF4          0x00000290
#define MCASP_O_RXBUF5          0x00000294
#define MCASP_O_RXBUF6          0x00000298
#define MCASP_O_RXBUF7          0x0000029C
#define MCASP_O_RXBUF8          0x000002A0
#define MCASP_O_RXBUF9          0x000002A4
#define MCASP_O_RXBUF10         0x000002A8
#define MCASP_O_RXBUF11         0x000002AC
#define MCASP_O_RXBUF12         0x000002B0
#define MCASP_O_RXBUF13         0x000002B4
#define MCASP_O_RXBUF14         0x000002B8
#define MCASP_O_RXBUF15         0x000002BC
#define	MCASP_0_WFIFOCTL	0x00001000
#define	MCASP_0_WFIFOSTS	0x00001004
#define	MCASP_0_RFIFOCTL	0x00001008
#define	MCASP_0_RFIFOSTS	0x0000100C


